-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июл 29 2020 г., 23:58
-- Версия сервера: 5.7.25
-- Версия PHP: 7.2.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test_posts`
--

-- --------------------------------------------------------

--
-- Структура таблицы `migration`
--

CREATE TABLE `migration` (
  `version` varchar(180) NOT NULL,
  `apply_time` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `migration`
--

INSERT INTO `migration` (`version`, `apply_time`) VALUES
('m000000_000000_base', 1596034237),
('m200729_144453_create_user_table', 1596034239),
('m200729_174831_create_post_table', 1596045022);

-- --------------------------------------------------------

--
-- Структура таблицы `post`
--

CREATE TABLE `post` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `status` smallint(6) NOT NULL DEFAULT '1',
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `post`
--

INSERT INTO `post` (`id`, `user_id`, `title`, `description`, `status`, `created_at`, `updated_at`) VALUES
(1, 1, 'У GTA Online усунули дві уразливості для швидкого отримання грошей', 'Розробники з Rockstar Games без зайвого шуму випустили латочку для GTA Online, яка усунула дві найпопулярніші уразливості, що дозволяли швидко накопичувати гроші. Про це в своєму мікроблозі розповів датамайнер TezFunz2. Він регулярно постачає аудиторію інформацією про випущених оновлення та виправлення для знаменитого проекту Rockstar.\r\n\r\nПерша вразливість була пов’язана c місією «Розплата» і безкоштовними машинами Elegy. Користувачам потрібно було дістати гараж на десять транспортних засобів, помістити всередину однакові автомобілі зазначеної марки, а потім приступити до виконання завдання. Його потрібно пройти до певного моменту, після чого виконати такі дії і почати перетворювати безкоштовні Elegy в машини моделі Arena War. Останні можна продавати, майже без праці поповнюючи свій гаманець.\r\n\r\nДруга вразливість стосується трансферу квартир між двома персонажами. Один з користувачів купував дорогі апартаменти, а другий – більш дешеве житло. Після цього потрібно було виконати кілька кроків і почати обмінюватися нерухомістю. Якщо все було зроблено правильно, в процесі гаманці гравців поповнювалися отриманими нечесним шляхом засобами. Цікаво, що Rockstar Games вже вдруге намагається усунути описану вразливість: перша спроба закінчилася невдачею, так як користувачі придумали обхідний шлях і знову почали активно застосовувати експлойт для особистого збагачення.', 1, 1596047858, 1596047858),
(2, 1, 'Xiaomi выпустила идеальный транспорт для города за 440 евро', 'В ближайшее время на рынке электрических двухколесных транспортных средств, предназначенных для эксплуатации в условиях города, произойдет настоящий переполох из-за Xiaomi. Китайский гигант запускает в продажу Ninebot C30 – самый дешевый электрический скутер в мире.\r\n\r\nXiaomi Ninebot C30 примечателен стильным внешним видом, хорошей функциональностью и неплохими характеристиками. Мотороллер оснащен двигателем мощностью 0,4 кВт и тягой в 40 Нм. Автономность хода составляет около 34 км, максимальная скорость – 25 км/ч. Спереди на скутере Xiaomi установлены дисковые тормоза, сзади – барабанные. Зарядить аккумулятор можно как на самом \"мопеде\", так и автономно, отсоединив его от агрегатов.', 1, 1596050130, 1596050130),
(3, 1, 'Компания Jaguar Land Rover представила бесконтактный сенсорный экран', 'Компания Jaguar Land Rover сообщила о разработке уже запатентованной технологии так называемого предиктивного соприкосновения (predictive touch), созданной в сотрудничестве с Кембриджским университетом.\r\nОжидается, что она позволит водителям меньше отвлекаться от дороги и к тому же снизить риск распространения бактерий и вирусов.\r\n\r\nНовая технология использует искусственный интеллект и набор датчиков для прогнозирования желаемой точки прикосновения пользователя к экрану — вне зависимости от того, какое окно отображается: карта спутниковой навигации, регулировка температуры в салоне или настройки развлекательной системы. Прикасаться к экрану при этом не требуется. Лабораторные тесты и испытания в реальных дорожных условиях продемонстрировали, что технология «предиктивного прикосновения» может примерно на 50% сократить усилия, которые водитель затрачивает на действия с сенсорным экраном медиасистемы автомобиля.\r\n\r\nПо словам разработчиков, технология бесконтактных взаимодействий находится на высоком уровне готовности к производству и может быть интегрирована в уже существующие сенсорные экраны и интерактивные дисплеи. Впрочем, точных сроков появления таких бесконтактных экранов на серийных моделях в Jaguar Land Rover пока не называют.', 1, 1596050188, 1596050188),
(10, 1, 'Китайские хакеры совершили кибератаки на Ватикан, — Reuters', 'В фирме по кибербезопасности Recorded Future сообщили, что китайские хакеры совершили кибератаки на Ватикан\r\n\r\nВ американской фирме по кибербезопасности Recorded Future сообщили, что хакеры из Пекина совершили кибератаки на Ватикан в преддверии предстоящих переговоров между Ватиканом и Китаем. Об этом сообщает Reuters, информирует enovosty.com/news.\r\n\r\nСообщается, что хакеры, связанные с китайским правительством, проникли в компьютерные сети Ватикана, включая представителя римской католической церкви в Гонконге.', 1, 1596050445, 1596050445);

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `auth_key` varchar(32) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `password_reset_token` varchar(255) DEFAULT NULL,
  `email` varchar(255) NOT NULL,
  `status` smallint(6) NOT NULL DEFAULT '10',
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `username`, `auth_key`, `password_hash`, `password_reset_token`, `email`, `status`, `created_at`, `updated_at`) VALUES
(1, 'vl.shtyka', 'FUq8-eLVixmKLUc9K4AahbWM10NhW9jX', '$2y$13$UupANHya9OiRo7P9oZXEWOScaWEtOR1vU7/pBdxt2uCRTiBCjDbHu', NULL, 'vl.shtyka@gmail.com', 10, 1596038155, 1596038731);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `migration`
--
ALTER TABLE `migration`
  ADD PRIMARY KEY (`version`);

--
-- Индексы таблицы `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `password_reset_token` (`password_reset_token`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `post`
--
ALTER TABLE `post`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
